wegi1/STM32F407ZGT6-BLACK-RTC/USER/ili9341.h
/*
 * ili9341.h
 *
 *  Created on: 10.09.2019
 *      Author: bolo
 */


#ifndef ILI9341_H_
#define ILI9341_H_


// FSMC_NE4 FSMC_A6
//LCD_REG       (*(volatile u16*)((uint32_t)(0x6C000000)))
//LCD_RAM       (*(volatile u16*)((uint32_t)(0x6C000080)))

// |------------------------------|
// |   LCD_PIN  |   CPU_PIN       |
// |------------------------------|
// | 1-GND      | GND             |
// | 2-RST      | RST  [NRST]     |
// |------------------------------|
// |        data lines            |
// |------------------------------|
// | 3-DB15     | PD10 [FSMC_D15] |
// | 4-DB14     | PD9  [FSMC_D14] |
// | 5-DB13     | PD8  [FSMC_D13] |
// | 6-DB12     | PE15 [FSMC_D12] |
// | 7-DB11     | PE14 [FSMC_D11] |
// | 8-DB10     | PE13 [FSMC_D10] |
// | 9-DB09     | PE12 [FSMC_D9]  |
// | 10-DB08    | PE11 [FSMC_D8]  |
// | 11-DB07    | PE10 [FSMC_D7]  |
// | 12-DB06    | PE9  [FSMC_D6]  |
// | 13-DB05    | PE8  [FSMC_D5]  |
// | 14-DB04    | PE7  [FSMC_D4]  |
// | 15-DB03    | PD1  [FSMC_D3]  |
// | 16-DB02    | PD0  [FSMC_D2]  |
// | 17-DB01    | PD15 [FSMC_D1]  |
// | 18-DB00    | PD14 [FSMC_D0]  |
// |------------------------------|
// |     control signals          |
// |------------------------------|
// | 19-RD      | PD4  [FSMC_NOE] |
// | 20-WR      | PD5  [FSMC_NWE] |
// | 21-RS      | PD13 [FSMC_A18] |
// | 22-CS_M    | PD7  [FSMC_NE1] |
// |------------------------------|
// |    TFT CONTROL SIGNALS       |
// |------------------------------|
// | 23-SCK     | PB13            |
// | 24-SCS     | PB12            |
// | 25-SI      | PB15            |
// | 26-SO      | PB14            |
// | 27-INT     | PC5             |
// |------------------------------|
// |       LCD BACK LIGHT         |
// |------------------------------|
// | 28-BLK     | PB0 (OR 1?)     |
// |------------------------------|
// | 29-SET     | NC              |
// |------------------------------|
// |       POWER SUPPLY           |
// |------------------------------|
// | 30-GND     | GND             |
// | 31-3V3     | 3.3V            |
// | 32-GND     | GND             |
// |------------------------------|



//**************************************************************************************

//------------------------------------
#include <inttypes.h>
#include <stdbool.h>
#include "stm32f407xx.h"
#include "types_h.h"
//------------------------------------
#define ILI9341_MEMCONTROL			0x36
//------------------------------------
#define ILI9341_PIXEL_WIDTH		320
#define ILI9341_PIXEL_HEIGHT 	240
#define ILI9341_PIXEL_COUNT		ILI9341_PIXEL_WIDTH * ILI9341_PIXEL_HEIGHT

// Any LCD needs to implement these common methods, which allow the low-level
// initialisation and pixel-setting details to be abstracted away from the
// higher level drawing and graphics code.

typedef enum
{
	LCD_ORIENTATION_LANDSCAPE = 0,
	LCD_ORIENTATION_LANDSCAPE_MIRROR = 1,
	LCD_ORIENTATION_LANDSCAPE_ROTATE = 2,
	LCD_ORIENTATION_LANDSCAPE_ROTATE_MIRROR = 3,
	LCD_ORIENTATION_PORTRAIT = 4,
	LCD_ORIENTATION_PORTRAIT_MIRROR = 5,
	LCD_ORIENTATION_PORTRAIT_ROTATE = 6,
	LCD_ORIENTATION_PORTRAIT_ROTATE_MIRROR = 7
} lcdOrientationTypeDef;


// This struct is used to indicate the capabilities of different LCDs
typedef struct
{
  uint16_t				width;         // LCD width in pixels (default orientation)
  uint16_t				height;        // LCD height in pixels (default orientation)
  lcdOrientationTypeDef	orientation;   // Whether the LCD orientation can be modified
  bool					touchscreen;   // Whether the LCD has a touch screen
  bool					hwscrolling;   // Whether the LCD support HW scrolling
  uint8_t				MADCTL_VAL;     // actual value of ILI9341 MADCTL register
} lcdPropertiesTypeDef;
//-------------------------------------------
/* Level 1 Commands */
#define LCD_SWRESET             0x01   /* Software Reset */
#define LCD_READ_DISPLAY_ID     0x04   /* Read display identification information */
#define LCD_RDDST               0x09   /* Read Display Status */
#define LCD_RDDPM               0x0A   /* Read Display Power Mode */
#define LCD_RDDMADCTL           0x0B   /* Read Display MADCTL */
#define LCD_RDDCOLMOD           0x0C   /* Read Display Pixel Format */
#define LCD_RDDIM               0x0D   /* Read Display Image Format */
#define LCD_RDDSM               0x0E   /* Read Display Signal Mode */
#define LCD_RDDSDR              0x0F   /* Read Display Self-Diagnostic Result */
#define LCD_SPLIN               0x10   /* Enter Sleep Mode */
#define LCD_SLEEP_OUT           0x11   /* Sleep out register */
#define LCD_PTLON               0x12   /* Partial Mode ON */
#define LCD_NORMAL_MODE_ON      0x13   /* Normal Display Mode ON */
#define LCD_DINVOFF             0x20   /* Display Inversion OFF */
#define LCD_DINVON              0x21   /* Display Inversion ON */
#define LCD_GAMMA               0x26   /* Gamma register */
#define LCD_DISPLAY_OFF         0x28   /* Display off register */
#define LCD_DISPLAY_ON          0x29   /* Display on register */
#define LCD_COLUMN_ADDR         0x2A   /* Colomn address register */
#define LCD_PAGE_ADDR           0x2B   /* Page address register */
#define LCD_GRAM                0x2C   /* GRAM register */
#define LCD_RGBSET              0x2D   /* Color SET */
#define LCD_RAMRD               0x2E   /* Memory Read */
#define LCD_PLTAR               0x30   /* Partial Area */
#define LCD_VSCRDEF             0x33   /* Vertical Scrolling Definition */
#define LCD_TEOFF               0x34   /* Tearing Effect Line OFF */
#define LCD_TEON                0x35   /* Tearing Effect Line ON */
#define LCD_MAC                 0x36   /* Memory Access Control register*/
#define LCD_VSCRSADD            0x37   /* Vertical Scrolling Start Address */
#define LCD_IDMOFF              0x38   /* Idle Mode OFF */
#define LCD_IDMON               0x39   /* Idle Mode ON */
#define LCD_PIXEL_FORMAT        0x3A   /* Pixel Format register */
#define LCD_WRITE_MEM_CONTINUE  0x3C   /* Write Memory Continue */
#define LCD_READ_MEM_CONTINUE   0x3E   /* Read Memory Continue */
#define LCD_SET_TEAR_SCANLINE   0x44   /* Set Tear Scanline */
#define LCD_GET_SCANLINE        0x45   /* Get Scanline */
#define LCD_WDB                 0x51   /* Write Brightness Display register */
#define LCD_RDDISBV             0x52   /* Read Display Brightness */
#define LCD_WCD                 0x53   /* Write Control Display register*/
#define LCD_RDCTRLD             0x54   /* Read CTRL Display */
#define LCD_WRCABC              0x55   /* Write Content Adaptive Brightness Control */
#define LCD_RDCABC              0x56   /* Read Content Adaptive Brightness Control */
#define LCD_WRITE_CABC          0x5E   /* Write CABC Minimum Brightness */
#define LCD_READ_CABC           0x5F   /* Read CABC Minimum Brightness */
#define LCD_READ_ID1            0xDA   /* Read ID1 */
#define LCD_READ_ID2            0xDB   /* Read ID2 */
#define LCD_READ_ID3            0xDC   /* Read ID3 */

/* Level 2 Commands */
#define LCD_RGB_INTERFACE       0xB0   /* RGB Interface Signal Control */
#define LCD_FRMCTR1             0xB1   /* Frame Rate Control (In Normal Mode) */
#define LCD_FRMCTR2             0xB2   /* Frame Rate Control (In Idle Mode) */
#define LCD_FRMCTR3             0xB3   /* Frame Rate Control (In Partial Mode) */
#define LCD_INVTR               0xB4   /* Display Inversion Control */
#define LCD_BPC                 0xB5   /* Blanking Porch Control register */
#define LCD_DFC                 0xB6   /* Display Function Control register */
#define LCD_ETMOD               0xB7   /* Entry Mode Set */
#define LCD_BACKLIGHT1          0xB8   /* Backlight Control 1 */
#define LCD_BACKLIGHT2          0xB9   /* Backlight Control 2 */
#define LCD_BACKLIGHT3          0xBA   /* Backlight Control 3 */
#define LCD_BACKLIGHT4          0xBB   /* Backlight Control 4 */
#define LCD_BACKLIGHT5          0xBC   /* Backlight Control 5 */
#define LCD_BACKLIGHT7          0xBE   /* Backlight Control 7 */
#define LCD_BACKLIGHT8          0xBF   /* Backlight Control 8 */
#define LCD_POWER1              0xC0   /* Power Control 1 register */
#define LCD_POWER2              0xC1   /* Power Control 2 register */
#define LCD_VCOM1               0xC5   /* VCOM Control 1 register */
#define LCD_VCOM2               0xC7   /* VCOM Control 2 register */
#define LCD_NVMWR               0xD0   /* NV Memory Write */
#define LCD_NVMPKEY             0xD1   /* NV Memory Protection Key */
#define LCD_RDNVM               0xD2   /* NV Memory Status Read */
#define LCD_READ_ID4            0xD3   /* Read ID4 */
#define LCD_PGAMMA              0xE0   /* Positive Gamma Correction register */
#define LCD_NGAMMA              0xE1   /* Negative Gamma Correction register */
#define LCD_DGAMCTRL1           0xE2   /* Digital Gamma Control 1 */
#define LCD_DGAMCTRL2           0xE3   /* Digital Gamma Control 2 */
#define LCD_INTERFACE           0xF6   /* Interface control register */

/* Extend register commands */
#define LCD_POWERA               0xCB   /* Power control A register */
#define LCD_POWERB               0xCF   /* Power control B register */
#define LCD_DTCA                 0xE8   /* Driver timing control A */
#define LCD_DTCB                 0xEA   /* Driver timing control B */
#define LCD_POWER_SEQ            0xED   /* Power on sequence register */
#define LCD_3GAMMA_EN            0xF2   /* 3 Gamma enable register */
#define LCD_PRC                  0xF7   /* Pump ratio control register */




// LEVEL 1 register control
//#define  ILI_NOP             0x00       // No Operation - NOP
#define   ILI_SWRESET         0x01       // Software Reset - SWRESET
//#define  ILI_RDDIDIF         0x04       // Read Display Identification Information (odczytuje dummy byte + 3 bajty informacji)
//#define  ILI_RDDST           0x09       // Read Display Status (odczytuje dummy byte + 4 bajty informacji)
//#define  ILI_RDDPM           0x0A       // Read Display Power Mode (odczytuje dummy byte + 1 bajt informacji)
//#define  ILI_RDDMADCTL       0x0B       // Read Display MADCTL (odczytuje dummy byte + 1 bajt informacji)
//#define  ILI_RDDCOLMOD       0x0C       // Read Display Pixel Format (odczytuje dummy byte + 1 bajt informacji)
//#define  ILI_RDDIM           0x0D       // Read Display Image Format (odczytuje dummy byte + 1 bajt informacji)
//#define  ILI_RDDSM           0x0E       // Read Display Signal Mode (odczytuje dummy byte + 1 bajt informacji)
//#define  ILI_RDDSDR          0x0F       // Read Display SELF-Diagnostic Result (odczytuje dummy byte + 1 bajt informacji)
//#define  ILI_SLPIN           0x10       // Enter Sleep Mode
#define   ILI_SLPOUT          0x11       // Sleep Out
//#define  ILI_PTLON           0x12       // Partial Mode ON
//#define  ILI_NORON           0x13       // Normal Display Mode ON
//#define  ILI_DINVOFF         0x20       // Display Inversion OFF
//#define  ILI_DINVON          0x21       // Display Inversion ON
#define   ILI_GAMSET          0x26       // Gamma Set (1 parametr 8b)
#define   ILI_DISPOFF         0x28       // Display OFF
#define   ILI_DISPON          0x29       // Display ON
#define   ILI_CASET           0x2A       // Column Address Set (4 parametry 8b: SC[15..8], SC[7..0], EC[15..8], EC[7..0])
#define   ILI_PASET           0x2B       // Page (row) Address Set (4 parametry 8b: SC[15..8], SC[7..0], EC[15..8], EC[7..0])
#define   ILI_RAMWR           0x2C       // Memory Write (n parametrów 18b, wywo³ywana bez parametrów po CASET i PASET)
//#define  ILI_RGBSET          0x2D       // Color Set (128 parametrów 8b, 32 dla R, 64 dla G i 32 dla B)
//#define  ILI_RAMRD           0x2E       // Memory Read (n parametrów 18b)
//#define  ILI_PLTAR           0x30       // Partial Area (4 parametry 8b: SR[15..8], SR[7..0], ER[15..8], ER[7..0])
//#define  ILI_VSCRDEF         0x33       // Vertical Scrolling Definition (6 parametrów 8b)
//#define  ILI_TEOFF           0x34       // Tearing Effect Line OFF
//#define  ILI_TEON            0x35       // Tearing Effect Line ON (1 parametr 8b)
#define   ILI_MADCTL          0x36       // Memory Access Control (1 parametr 8b)
//#define  ILI_VSCRSADD        0x37       // Vertical Scrolling Start Address (2 parametry 8b)
#define   ILI_IDMOFF          0x38       // Idle Mode OFF
#define   ILI_IDMON           0x39       // Idle Mode ON
#define   ILI_PIXSET          0x3A       // COLMOD: Pixel Format Set (1 parametr 8b)
#define   ILI_RAMWRCont       0x3C       // Write Memory Continue (n parametrów 18b)
//#define  ILI_RAMRDCont       0x3E       // Read Memory Continue (odczytuje dummy byte i n danych 18b)
//#define  ILI_STS             0x44       // Set Tear Scanline (2 parametry 8b)
//#define  ILI_GS              0x45       // Get Scanline (odczytuje dummy i 2 bajty informacji)
//#define  ILI_WRDISBV         0x51       // Write Display Brightness (1 parametr 8b)
//#define  ILI_RDDISBV         0x52       // Read Display Brightness (odczytuje dummy byte i 1 bajt informacji)
//#define  ILI_WRCTRLD         0x53       // Write CTRL Display (1 parametr 8b)
//#define  ILI_RDCTRLD         0x54       // Read CTRL Display (odczytuje dummy byte i 1 bajt informacji)
//#define  ILI_WRCABC          0x55       // Write Content Adaptive Brightness Control (1 parametr 8b)
//#define  ILI_RDCABC          0x56       // Read Content Adaptive Brightness Control (odczytuje dummy byte i 1 bajt informacji)
//#define  ILI_WRCABCMB        0x5E       // Write CABC Minimum Brightness (1 parametr 8b)
//#define  ILI_RDCABCMB        0x5F       // Read CABC Minimum Brightness (odczytuje dummy byte i 1 bajt informacji)
//#define  ILI_RDID1           0xDA       // Read ID1 (odczytuje dummy byte i 1 bajt informacji)
//#define  ILI_RDID2           0xDB       // Read ID2 (odczytuje dummy byte i 1 bajt informacji)
//#define  ILI_RDID3           0xDC       // Read ID3 (odczytuje dummy byte i 1 bajt informacji)
// LEVEL 2 register control
//#define  ILI_IFMODE          0xB0       // RGB  Interface Signal Control (1 parametr 8b)
#define   ILI_FRMCTR1         0xB1       // Frame Rate Control (In Normal Mode/Full Colors) (2 parametry 8b)
//#define  ILI_FRMCTR2         0xB2       // Frame Rate Control (In Idle Mode/8 Colors) (2 parametry 8b)
//#define  ILI_FRMCTR3         0xB3       // Frame Rate Control (In Partial Mode/Full Colors) (2 parametry 8b)
//#define  ILI_INVTR           0xB4       // Display Inversion Control (1 parametr 8b)
//#define  ILI_PRCTR           0xB5       // Blanking Porch Control (4 parametry 8b)
#define   ILI_DISCTRL         0xB6       // Display Function Control (4 parametry 8b)
//#define  ILI_ETMOD           0xB7       // Entry Mode Set (1 parametr 8b)
//#define  ILI_BLCTRL1         0xB8       // Backlight Control 1 (1 parametr 8b)
//#define  ILI_BLCTRL2         0xB9       // Backlight Control 2 (1 parametr 8b)
//#define  ILI_BLCTRL3         0xBA       // Backlight Control 3 (1 parametr 8b)
//#define  ILI_BLCTRL4         0xBB       // Backlight Control 4 (1 parametr 8b)
//#define  ILI_BLCTRL5         0xBC       // Backlight Control 5 (1 parametr 8b)
//#define  ILI_BLCTRL7         0xBE       // Backlight Control 7 (1 parametr 8b)
//#define  ILI_BLCTRL8         0xBF       // Backlight Control 8 (1 parametr 8b)
#define   ILI_PWCTRL1         0xC0       // Power Control 1 (1 parametr 8b)
#define   ILI_PWCTRL2         0xC1       // Power Control 2 (1 parametr 8b)
#define   ILI_VMCTRL1         0xC5       // VCOM Control 1 (2 parametry 8b)
#define   ILI_VMCTRL2         0xC7       // VCOM Control 2 (1 parametr 8b)
//#define  ILI_NVMWR           0xD0       // NV Memory Write (2 parametry 8b)
//#define  ILI_NVMPKEY         0xD1       // NV Memory Protection Key (3 parametry 8b)
//#define  ILI_RDNVM           0xD2       // NV Memory Status Read (odczyt dummy byte i 2 bajty informacji)
//#define  ILI_RDID4           0xD3       // Read ID4 (odczytuje dummy byte i 3 bajty informacji)
#define   ILI_PGAMCTRL        0xE0       // Positive Gamma Correction (15 parametrów 8b)
#define   ILI_NGAMCTRL        0xE1       // Negative Gamma Correction (15 parametrów 8b)
//#define  ILI_DGAMCTRL1       0xE2       // Digital Gamma Control 1 (16 parametrów 8b)
//#define  ILI_DGAMCTRL2       0xE3       // Digital Gamma Control 2 (16 parametrów 8b)
//#define  ILI_IFCTL           0xF6       // Interface Control (3 parametry 8b)
// EXTEND register control
#define   ILI_PCA             0xCB       // Power Control A (5 parametrów 8b)
#define   ILI_PCB             0xCF       // Power Control B (3 parametry 8b)
#define   ILI_DTCA_ic         0xE8       // Driver Timming Control A (3 parametry 8b) - for internal clock
//#define  ILI_DTCA_ec         0xE9       // Driver Timming Control A (3 parametry 8b) - for external clock
#define   ILI_DTCB            0xEA       // Driver Timming Control B (2 parametry 8b)
#define   ILI_POSC            0xED       // Power On Sequence Control (4 parametry 8b)
#define   ILI_E3G             0xF2       // Enable 3G (1 parametr 8b)
#define   ILI_PRC             0xF7       // Pump Ratio Control (1 parametr 8b)

