wegi1/STM32F407ZGT6-BLACK-RTC/USER/ili9341.h
#if LCD_DIRECT==1
	#define  LCD_ROW_NUM    320                // Number of rows
	#define  LCD_COL_NUM    240                // Number of columns
#else
	#define  LCD_ROW_NUM    320                //Number of rows
	#define  LCD_COL_NUM    240                //Number of columns
#endif
#define SCREEN_PIXELS       (LCD_ROW_NUM * LCD_COL_NUM)
/*--------------------------------------------------------------------
-------------------------------------------------------------------------------------------------------*/
/*-------------------------------------------------------------------------------------------------- -----
* Resource definition
---------------------------------------------------------------------------------------------------- ---*/
//typedef uint8_t       bool;
//typedef uint8_t       u8;
//typedef uint16_t      u16;
//typedef int16_t       s16;
//typedef uint32_t      u32;


#define LCD_REG       (*(volatile u16*)((uint32_t)(0x6C000000)))
#define LCD_RAM       (*(volatile u16*)((uint32_t)(0x6C000080)))
#define swap(a,b) {u16 t=a;a=b;b=t;}
//-------------------------------
//extern RNG_HandleTypeDef hrng;
//-------------------------------
void LCD_ILI9341_init(void);

void LCD_OpenWin(u16 x0, u16 y0, u16 x1, u16 y1);
void LCD_ClrScr(u16 BackColor);
void LCD_Put_Pixel(u16 x0, u16 y0, u16 Color);
void LCD_WriteReg(u16 data);
void LCD_WriteData(u16 data);
void lcdSetOrientation(lcdOrientationTypeDef value);
//-------------------------------

//-------------------------------
#endif /* ILI9341_H_ */


